export default {

  exampleList: [{
      explain: '4到16位（字母，数字，下划线，减号）:',
      regExp: '^[a-zA-Z0-9_-]{4,16}$'
    },
    {
      explain: '密码强度正则，最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符:',
      regExp: '^.*(?=.{6,})(?=.*\\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$'
    },
    {
      explain: '正整数正则:',
      regExp: '^\\d+$'
    },
    {
      explain: '负整数正则:',
      regExp: '^-\\d+$'
    },
    {
      explain: '整数正则:',
      regExp: ' ^-?\\d+$'
    },
    {
      explain: '正数正则:',
      regExp: '^\\d*\\.?\\d+$'
    },
    {
      explain: '负数正则:',
      regExp: '^-\\d*\\.?\\d+$'
    },
    {
      explain: '数字正则:',
      regExp: '^-?\\d*\\.?\\d+$'
    },
    {
      explain: 'Email正则:',
      regExp: '^([A-Za-z0-9_\\-\\.])+\\@([A-Za-z0-9_\\-\\.])+\\.([A-Za-z]{2,4})$'
    },
    {
      explain: '手机号码正则:',
      regExp: '^((13[0-9])|(14[5|7])|(15([0-3]|[5-9]))|(18[0,5-9]))\\d{8}$'
    },
    {
      explain: '身份证号正则:',
      regExp: '^[1-9]\\d{5}(18|19|([23]\\d))\\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\\d{3}[0-9Xx]$'
    },
    {
      explain: 'IPv4地址正则:',
      regExp: '^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$'
    },
    {
      explain: '十六进制颜色正则:',
      regExp: '^#?([a-fA-F0-9]{6}|[a-fA-F0-9]{3})$'
    },
    {
      explain: '日期正则，简单判定,未做月份及日期的判定:',
      regExp: '^\\d{4}(\\-)\\d{1,2}\\1\\d{1,2}$'
    },
    {
      explain: '日期正则，复杂判定:',
      regExp: '^(?:(?!0000)[0-9]{4}-(?:(?:0[1-9]|1[0-2])-(?:0[1-9]|1[0-9]|2[0-8])|(?:0[13-9]|1[0-2])-(?:29|30)|(?:0[13578]|1[02])-31)|(?:[0-9]{2}(?:0[48]|[2468][048]|[13579][26])|(?:0[48]|[2468][048]|[13579][26])00)-02-29)$'
    },
    {
      explain: '车牌号正则:',
      regExp: '^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$'
    },
    {
      explain: '包含中文正则:',
      regExp: '[\\u4E00-\\u9FA5]'
    },
    {
      explain: '非字母数字*#:',
      regExp: '[^\\a-\\z\\A-\\Z0-9\\*\\#]'
    },

  ]

}
